package com.itheima.a04myfunction;

/*
 * 方法引用：
 * 		把已经有的方法拿过来用，当作函数式接口中抽象方法的方法体
 *
 * 方法引用需满足4个条件：
 * 		1.引用处必须是函数式接口
 * 		2.被引用的方法必须已经存在
 * 		3.被引用方法的形参和返回值，需要跟抽象方法保持一致
 * 		3.被引用方法的功能要满足当前需求
 *
 *
 * 总结：
 * 	1.什么是方法引用？
 * 		把已经有的方法拿过来用，当作函数式接口中抽象方法的方法体
 *
 * 	2. :: 是什么符号？
 * 		方法引用符
 *
 * 	3.方法引用时需要注意什么？
 * 		- 需要有函数式接口
 * 		- 被引用的方法必须已经存在
 * 		- 被引用方法的形参和返回值需要跟抽象方法保持一致
 * 		- 被引用方法的功能要满足当前需求
 *
 * ******************************************************************
 *
 * 方法引用的分类：
 * 	1.引用静态方法
 * 	2.引用成员方法
 * 		a.引用其他类的成员方法
 * 		b.引用本类的成员方法
 * 		c.引用父类的成员方法
 * 	3.引用构造方法
 * 	4.其他调用方法
 * 		a.使用类名引用成员方法
 * 		b.引用数组的构造方法
 */
public class Test {
}
