package com.itheima.unit;

/*
 * 单元测试：
 * 	- 单元测试就是针对最小的功能单元编写测试代码，Java程序最小的功能单元是方法，因此，单元测试就是Java方法的测试，进而检查方法的正确性。
 *
 * JUnit单元测试框架：
 * 	- JUnit是使用java语言实现的单元测试框架，它是开源的，java开发者都应当学习并使用JUnit编写单元测试。
 *  - 此外，几乎所有的IDE工具都集成了JUnit，这样我们就可以直接在IDE中编写并运行JUnit测试，JUnit目前最新版本是5。（截止视频课程时间，最稳定版本是4）
 *
 * JUnit优点：
 * 	- JUnit可以灵活的选择执行哪些测试方法，可以一键执行全部测试方法。
 *  - 单元测试中的某个方法测试失败了，不会影响其他测试方法的测试。
 *  - 运行成功是绿色，运行失败是红色。
 *
 * 总结：
 * 	1.JUnit单元测试是做什么的？
 * 		- 测试方法的正确性的，可以方便快捷的直接运行。
 *  2.JUnit单元测试的优点是什么？
 * 		- JUnit可以选择执行哪些测试方法，可以一键执行全部测试方法的测试。
 * 		- JUnit可以生成测试报告，如果测试良好则是绿色；如果测试失败，则是红色。
 * 		- 单元测试中的某个方法测试失败了，不会影响其他测试方法的测试。
 */
public class Test1 {
}
