package oopExtends.test1;

/*
 * 继承：
 * - Java中提供一个关键字extends，用这个关键字，我们可以让一个类和另一个类建立起继承关系。
 * 	 `public class Student extends Person{}`
 * - Student 称为子类（派生类），Person称为父类（基类或超类）。
 *
 * 使用继承的好处
 * - 可以把多个子类中重复的代码抽取到父类中了，提高代码的复用性。
 * - 子类可以在父类的基础上，增加其他的功能，使子类更强大。
 *
 * 继承要学习的点：
 * - 自己设计
 * - 用别人的
 *
 * 什么时候用继承？
 * - 当类与类之间，存在相同（共性）的内容，并满足子类是父类中的一种，就可以考虑使用继承，来优化代码。
 *
 * 小结：
 * 1.什么是继承、继承的好处？
 * 		继承是面向对象三大特征之一，可以让类跟类之间产生子父的关系。
 * 		可以把多个子类中重复的代码抽取到父类中，子类可以直接使用，减少代码冗余，提高代码的复用性
 * 2.继承的格式？
 * 		`public class 子类 extends 父类 {}`
 * 3.继承后子类的特点？
 * 		子类可以得到父类的属性和行为，子类可以使用。
 * 		子类可以在父类的基础上新增其他功能，子类更强大。
 */

public class Test1 {
}
